const mockStandard = [
    {
        "id": 1,
        "standardTitle": "ผลการเรียนรู้ระดับหลักสูตร (PLOs : Program-Level Learning Outcomes)",
        "details": [
            {
                "standardNo": 1,
                "standardName": "ความรู้ทางด้านวิศวกรรม และพื้นฐานทางวิทยาศาสตร์",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "ประยุกต์ใช้ความรู้ด้านคณิตศาสตร์ วิทยาศาสตร์ สถิติและความน่าจะเป็น รวมทั้งคณิตศาสตร์ไม่ต่อเนื่อง กับงานด้านวิศวกรรมคอมพิวเตอร์ ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 2,
                        "subStandardName": "ประยุกต์ใช้ความรู้ด้านการวิเคราะห์วงจรไฟฟ้าพื้นฐาน วงจรและอุปกรณ์อิเล็กทรอนิกส์กับการเชื่อมต่อไมโครคอนโทรลเลอร์ ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 3,
                        "subStandardName": "ประยุกต์ใช้ภาษาโปรแกรม การโปรแกรมเชิงวัตถุ โครงสร้างข้อมูล การวิเคราะห์อัลกอริทึมเบื้องต้น เพื่อจัดการกับปัญหาโดยวิธีการทางซอฟต์แวร์ ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 4,
                        "subStandardName": "อธิบายโครงสร้าง องค์ประกอบ และการทำงานระดับฮาร์ดแวร์ของคอมพิวเตอร์ รวมถึงวงจรดิจิตอลพื้นฐาน ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 5,
                        "subStandardName": "อธิบายการส่งข้อมูลทั้งแอนะล็อกและดิจิตอล อุปกรณ์ ตัวกลาง มัลติเพล็กซ์ สวิตซ์ การส่งข้อมูลแบบเฟรม การตรวจสอบและแก้ไขความผิดพลาด การควบคุมการไหลของข้อมูล การหาเส้นทาง รวมทั้งเครือข่ายอีเทอร์เน็ต และเครือข่ายไอพี ทั้งแบบใช้สายและไร้สาย",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 6,
                        "subStandardName": "อธิบายหลักการพื้นฐานของความปลอดภัยของข้อมูล การเข้ารหัสข้อมูล",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 7,
                        "subStandardName": "อธิบายโครงสร้างและการทำงานของระบบปฏิบัติการ การจัดการทรัพยากรในระบบคอมพิวเตอร์ การทำงานระหว่างโพรเซส ระบบไฟล์ การทำงานแบบเครื่องจักรเสมือน (Virtualization) และการประมวลผลแบบคลาวด์ (Cloud Computing)",
                        mapping:[]
                    },
                ]
            },
            {
                "standardNo": 2,
                "standardName": "การวิเคราะห์ปัญหาทางวิศวกรรม",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "วิเคราะห์ปัญหาทางวิศวกรรมคอมพิวเตอร์ เข้าใจปัญหาและอธิบายความต้องการ และสามารถระบุข้อกำหนดของปัญหา โดยใช้วิธีการทางวิศวกรรม",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 2,
                        "subStandardName": "ค้นคว้าเพื่อค้นหาแนวทางหรือวิธีการในการแก้ไขปัญหา แสดงข้อเปรียบเทียบระหว่างแนวทางหรือวิธีการในการแก้ไขปัญหา แสดงเหตุผลในการเลือกแนวทางในการแก้ไขปัญหา ",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 3,
                "standardName": "การออกแบบและพัฒนาเพื่อหาคำตอบของปัญหา",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "ออกแบบและพัฒนาระบบคอมพิวเตอร์ให้ตรงตามข้อกำหนด โดยใช้วิธีการทางวิศวกรรม ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 2,
                        "subStandardName": "ออกแบบและพัฒนาฮาร์ดแวร์คอมพิวเตอร์ โดยใช้วงจรดิจิตอล ไมโครคอนโทรลเลอร์ เพื่อใช้งานในรูปแบบสมองกลฝังตัว (Embedded Systems) หรือ Internet of Things ได้ ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 3,
                        "subStandardName": "ออกแบบและพัฒนาแอปพลิเคชันบนแพล็ทฟอร์ม Mobile ที่สามารถนำไปใช้งานได้จริง ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 4,
                        "subStandardName": "ออกแบบและพัฒนาโปรแกรมประยุกต์บนเว็บ ที่มีการติดต่อกับฐานข้อมูล โดยเลือกใช้ภาษาและเฟรมเวิร์กที่เหมาะสม โดยใช้กระบวนการทางวิศวกรรมซอฟต์แวร์ โดยมีความชำนาญอย่างน้อย 1 แพล็ทฟอร์ม",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 5,
                        "subStandardName": "ติดตั้งและดูแลระบบคอมพิวเตอร์เบื้องต้นในแบบ Windows Based หรือ Unix Based ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 6,
                        "subStandardName": "ติดตั้ง และดูแลระบบเครือข่ายคอมพิวเตอร์ในระดับองค์กร รวมทั้งสามารถใช้เครื่องมือทางเครือข่ายเพื่อวิเคราะห์ปัญหา",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 4,
                "standardName": "การพิจารณาตรวจสอบ",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "ประเมินงานทางวิศวกรรมคอมพิวเตอร์ ระบุจุดบกพร่อง หรือจุดที่สามารถปรับปรุงหรือพัฒนา และแสดงแนวทางการแก้ไขได้",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 5,
                "standardName": "การใช้อุปกรณ์เครื่องมือทันสมัย",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "มีทักษะในการใช้และเลือกใช้เครื่องมือทางวิศวกรรมคอมพิวเตอร์ที่เหมาะสมและทันสมัย โดยคำนึงถึงข้อกำหนดและข้อจำกัดของเครื่องมือและอุปกรณ์นั้น",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 6,
                "standardName": "การทำงานร่วมกันเป็นทีม",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "มีทักษะในการทำงานร่วมกับผู้อื่นทั้งในฐานะสมาชิกของกลุ่มและผู้นำกลุ่ม",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 7,
                "standardName": "การติดต่อสื่อสาร",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "มีทักษะนำเสนอข้อมูล (Presentation) ได้อย่างเหมาะสมกับผู้ฟัง (technical และ non-technical) ทั้งเนื้อหาและรูปแบบ ข้อมูลตรงประเด็น มีความน่าสนใจ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 2,
                        "subStandardName": "มีทักษะจัดทำเอกสารได้อย่างเหมาะสมทั้งเนื้อหาและรูปแบบ มีทักษะในการทำเอกสารโดยใช้ซอฟต์แวร์สำเร็จรูป",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 8,
                "standardName": "กิจกรรมสังคม สภาพแวดล้อม การพัฒนาที่ยั่งยืน และวิชาชีพวิศวกรรม",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "ตระหนักในความรับผิดชอบของวิชาชีพวิศวกรรม ต่อสังคม สภาพแวดล้อม และความยั่งยืน",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 9,
                "standardName": "จรรยาบรรณวิชาชีพ",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "ตระหนักในจรรยาบรรณวิชาชีพ",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 10,
                "standardName": "การบริหารงานทางวิศวกรรมและการลงทุน",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "อธิบายแนวโน้มและการพัฒนาในด้านเศรษฐกิจดิจิตอล",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 2,
                        "subStandardName": "มีทักษะในการวางแผนและบริหารโครงงานทางวิศวกรรม",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 11,
                "standardName": "การเรียนรู้ตลอดชีพ",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "มีทักษะในการพัฒนาความรู้ความชำนาญทางคอมพิวเตอร์ด้วยตนเองอย่างต่อเนื่อง",
                        mapping:[]
                    }
                ]
            }
        ]
    },
    {
        "id": 2,
        "standardTitle": "กรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ (TQF : Thai Qualifications Framework for Higher Education)",
        "details": [
            {
                "standardNo": 1,
                "standardName": "คุณธรรม จริยธรรม",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "ตระหนักในคุณค่าและคุณธรรม จริยธรรม เสียสละ และซื่อสัตย์สุจริต",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 2,
                        "subStandardName": "มีวินัย ตรงต่อเวลา และความรับผิดชอบต่อตนเอง วิชาชีพและสังคม",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 3,
                        "subStandardName": "มีภาวะความเป็นผู้นําและผู้ตาม สามารถทํางานเป็นทีมและสามารถแก้ไขข้อขัอแย้งและลําดับความสําคัญ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 4,
                        "subStandardName": "เคารพสิทธิและรับฟังความคิดเห็นของผู้อื่น รวมทั้งเคารพในคุณค่าและศักดิ์ศรีของความเป็นมนุษย์",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 5,
                        "subStandardName": "เคารพกฎระเบียบและข้อบังคับต่าง ๆ ขององค์กรและสังคม",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 6,
                        "subStandardName": "สามารถวิเคราะห์ผลกระทบจากการใช้คอมพิวเตอร์ต่อบุคคล องค์กรและสังคม",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 7,
                        "subStandardName": "มีจรรยาบรรณทางวิชาการและวิชาชีพ ",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 2,
                "standardName": "ความรู้",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "มีความรู้และความเข้าใจเกี่ยวกับหลักการและทฤษฎีที่สําคัญในเนื้อหาสาขาวิชาที่ศึกษา",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 2,
                        "subStandardName": "สามารถวิเคราะห์ปัญหา เข้าใจและอธิบายความต้องการทางคอมพิวเตอร์ รวมทั้งประยุกต์ความรู้ ทักษะ และการใช้เครื่องมือที่เหมาะสมกับการแก้ไขปัญหา",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 3,
                        "subStandardName": "สามารถวิเคราะห์ ออกแบบ ติดตั้ง ปรับปรุงและ/หรือประเมินระบบองค์ประกอบต่าง ๆ ของระบบคอมพิวเตอร์ให้ได้ตรงตามข้อกําหนด",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 4,
                        "subStandardName": "สามารถติดตามความก้าวหน้าทางวิชาการและวิวัฒนาการคอมพิวเตอร์รวมทั้งการนําไปประยุกต์",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 5,
                        "subStandardName": "รู้ เข้าใจและสนใจพัฒนาความรู้ ความชํานาญทางคอมพิวเตอร์อย่างต่อเนื่อง",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 6,
                        "subStandardName": "มีความรู้ในแนวกว้างของสาขาวิชาที่ศึกษาเพื่อให้เล็งเห็นการเปลี่ยนแปลง และเข้าใจผลกระทบของเทคโนโลยีใหม่ ๆ ที่เกี่ยวข้อง",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 7,
                        "subStandardName": "มีประสบการณ์ในการพัฒนาและ/หรือการประยุกต์ซอฟต์แวร์ที่ใช้งานได้จริง",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 8,
                        "subStandardName": "สามารถบูรณาการความรู้ในสาขาวิชาที่ศึกษากับความรู้ในศาสตร์อื่น ๆ ที่เกี่ยวข้อง",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 3,
                "standardName": "ทักษะทางปัญญา",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "คิดอย่างมีวิจารณญาณและอย่างเป็นระบบ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 2,
                        "subStandardName": "สามารถสืบค้น ตีความ และประเมินผลสารสนเทศ เพื่อใช้ในการแก้ปัญหาอย่างสร้างสรรค์",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 3,
                        "subStandardName": "สามารถรวบรวม ศึกษา วิเคราะห์และสรุปประเด็นปัญหาและความต้องการ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 4,
                        "subStandardName": "สามารถประยุกต์ความรู้และทักษะกับการแก้ไขปัญหาทางคอมพิวเตอร์ได้อย่างเหมาะสม",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 4,
                "standardName": "ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "สามารถสื่อสารทั้งภาษาไทยและภาษาต่างประเทศกับกลุ่มคนหลากหลายได้อย่างมีประสิทธิภาพ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 2,
                        "subStandardName": "สามารถให้ความช่วยเหลือและอํานวยความสะดวกในการแก้ปัญหาสถานการณ์ต่าง ๆ ทั้งในบทบาทของผู้นํา หรือในบทบาทของผู้ร่วมทีมทํางาน",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 3,
                        "subStandardName": "สามารถใช้ความรู้ในศาสตร์มาชี้นําสังคมในประเด็นที่เหมาะสม",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 4,
                        "subStandardName": "มีความรับผิดชอบในการกระทําของตนเองและรับผิดชอบงานในกลุ่ม",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 5,
                        "subStandardName": "สามารถเป็นผู้ริเริ่มแสดงประเด็นในการแก้ไขสถานการณ์ทั้งส่วนตัวและส่วนรวม  พร้อมทั้้งแสดงจุดยืนอย้างพอเหมาะทั้งของตนเองและของกลุ่ม",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 6,
                        "subStandardName": "มีความรับผิดชอบการพัฒนาการเรียนรู้ทั้งของตนเองและทางวิชาชีพอย่างต่อเนื่อง",
                        mapping:[]
                    }
                ]
            },
            {
                "standardNo": 5,
                "standardName": "ทักษะการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยีสารสนเทศ",
                "subStandard": [
                    {
                        "subStandardNo": 1,
                        "subStandardName": "มีทักษะการใช้เครื่องมือที่จําเป็นที่มีอยู่ในปัจจุบันต่อการทํางานที่เกี่ยวกับคอมพิวเตอร์",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 2,
                        "subStandardName": "สามารถแนะนําประเด็นการแก้ไขปัญหาโดยใช้สารสนเทศทางคณิตศาสตร์หรือการแสดงสถิติประยุกต์ต่อปัญหาที่เกี่ยวข้องอย่างสร้างสรรค์",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 3,
                        "subStandardName": "สามารถสื่อสารอย่างมีประสิทธิภาพทั้งปากเปล่าและการเขียน พร้อมทั้งเลือกใช้รูปแบบของสื่อการนําเสนอได้อย่างเหมาะสม ",
                        mapping:[]
                    },
                    {
                        "subStandardNo": 4,
                        "subStandardName": "สามารถใช้เทคโนโลยีสารสนเทศได้อย่างเหมาะสม",
                        mapping:[]
                    }
                ]
            }
        ]
    }, 
    //test swap
    // {
    //     "id": 3,
    //     "standardTitle": "aaaa",
    //     "details": []
    // },
    // {
    //     "id": 4,
    //     "standardTitle": "bbbb",
    //     "details": []
    // },
    // {
    //     "id": 5,
    //     "standardTitle": "cccc",
    //     "details": []
    // }
]

export { mockStandard }